<?php 
/*
8x8 dot Japanese font for Arduboy

Copyright (c) 2016 emutyworks

Released under the MIT license
https://github.com/emutyworks/8x8DotJPFont/blob/master/LICENSE.txt
*/
mb_language('Japanese');
mb_internal_encoding('UTF-8');
define('LIST_MAX', 2965 + 3390);

$img = imagecreatefrompng("../misaki_png_2015-04-10/misaki_gothic.png");

$char_list = "
亜唖娃阿哀愛挨姶逢葵茜穐悪握渥旭葦
芦鯵梓圧斡扱宛姐虻飴絢綾鮎或粟袷
安庵按暗案闇鞍杏以伊位依偉囲夷委
威尉惟意慰易椅為畏異移維緯胃萎衣
謂違遺医井亥域育郁磯一壱溢逸稲茨
芋鰯允印咽員因姻引飲淫胤蔭
院陰隠韻吋右宇烏羽迂雨卯鵜窺丑碓
臼渦嘘唄欝蔚鰻姥厩浦瓜閏噂云運雲
荏餌叡営嬰影映曳栄永泳洩瑛盈穎頴
英衛詠鋭液疫益駅悦謁越閲榎厭円
園堰奄宴延怨掩援沿演炎焔煙燕猿縁
艶苑薗遠鉛鴛塩於汚甥凹央奥往応押
旺横欧殴王翁襖鴬鴎黄岡沖荻億屋憶
臆桶牡乙俺卸恩温穏音下化仮何伽価
佳加可嘉夏嫁家寡科暇果架歌河火珂
禍禾稼箇花苛茄荷華菓蝦課嘩貨迦過
霞蚊俄峨我牙画臥芽蛾賀雅餓駕介会
解回塊壊廻快怪悔恢懐戒拐改
魁晦械海灰界皆絵芥蟹開階貝凱劾外
咳害崖慨概涯碍蓋街該鎧骸浬馨蛙垣
柿蛎鈎劃嚇各廓拡撹格核殻獲確穫覚
角赫較郭閣隔革学岳楽額顎掛笠樫
橿梶鰍潟割喝恰括活渇滑葛褐轄且鰹
叶椛樺鞄株兜竃蒲釜鎌噛鴨栢茅萱粥
刈苅瓦乾侃冠寒刊勘勧巻喚堪姦完官
寛干幹患感慣憾換敢柑桓棺款歓汗漢
澗潅環甘監看竿管簡緩缶翰肝艦莞観
諌貫還鑑間閑関陥韓館舘丸含岸巌玩
癌眼岩翫贋雁頑顔願企伎危喜器基奇
嬉寄岐希幾忌揮机旗既期棋棄
機帰毅気汽畿祈季稀紀徽規記貴起軌
輝飢騎鬼亀偽儀妓宜戯技擬欺犠疑祇
義蟻誼議掬菊鞠吉吃喫桔橘詰砧杵黍
却客脚虐逆丘久仇休及吸宮弓急救
朽求汲泣灸球究窮笈級糾給旧牛去居
巨拒拠挙渠虚許距鋸漁禦魚亨享京供
侠僑兇競共凶協匡卿叫喬境峡強彊怯
恐恭挟教橋況狂狭矯胸脅興蕎郷鏡響
饗驚仰凝尭暁業局曲極玉桐粁僅勤均
巾錦斤欣欽琴禁禽筋緊芹菌衿襟謹近
金吟銀九倶句区狗玖矩苦躯駆駈駒具
愚虞喰空偶寓遇隅串櫛釧屑屈
掘窟沓靴轡窪熊隈粂栗繰桑鍬勲君薫
訓群軍郡卦袈祁係傾刑兄啓圭珪型契
形径恵慶慧憩掲携敬景桂渓畦稽系経
継繋罫茎荊蛍計詣警軽頚鶏芸迎鯨
劇戟撃激隙桁傑欠決潔穴結血訣月件
倹倦健兼券剣喧圏堅嫌建憲懸拳捲検
権牽犬献研硯絹県肩見謙賢軒遣鍵険
顕験鹸元原厳幻弦減源玄現絃舷言諺
限乎個古呼固姑孤己庫弧戸故枯湖狐
糊袴股胡菰虎誇跨鈷雇顧鼓五互伍午
呉吾娯後御悟梧檎瑚碁語誤護醐乞鯉
交佼侯候倖光公功効勾厚口向
后喉坑垢好孔孝宏工巧巷幸広庚康弘
恒慌抗拘控攻昂晃更杭校梗構江洪浩
港溝甲皇硬稿糠紅紘絞綱耕考肯肱腔
膏航荒行衡講貢購郊酵鉱砿鋼閤降
項香高鴻剛劫号合壕拷濠豪轟麹克刻
告国穀酷鵠黒獄漉腰甑忽惚骨狛込此
頃今困坤墾婚恨懇昏昆根梱混痕紺艮
魂些佐叉唆嵯左差査沙瑳砂詐鎖裟坐
座挫債催再最哉塞妻宰彩才採栽歳済
災采犀砕砦祭斎細菜裁載際剤在材罪
財冴坂阪堺榊肴咲崎埼碕鷺作削咋搾
昨朔柵窄策索錯桜鮭笹匙冊刷
察拶撮擦札殺薩雑皐鯖捌錆鮫皿晒三
傘参山惨撒散桟燦珊産算纂蚕讃賛酸
餐斬暫残仕仔伺使刺司史嗣四士始姉
姿子屍市師志思指支孜斯施旨枝止
死氏獅祉私糸紙紫肢脂至視詞詩試誌
諮資賜雌飼歯事似侍児字寺慈持時次
滋治爾璽痔磁示而耳自蒔辞汐鹿式識
鴫竺軸宍雫七叱執失嫉室悉湿漆疾質
実蔀篠偲柴芝屡蕊縞舎写射捨赦斜煮
社紗者謝車遮蛇邪借勺尺杓灼爵酌釈
錫若寂弱惹主取守手朱殊狩珠種腫趣
酒首儒受呪寿授樹綬需囚収周
宗就州修愁拾洲秀秋終繍習臭舟蒐衆
襲讐蹴輯週酋酬集醜什住充十従戎柔
汁渋獣縦重銃叔夙宿淑祝縮粛塾熟出
術述俊峻春瞬竣舜駿准循旬楯殉淳
準潤盾純巡遵醇順処初所暑曙渚庶緒
署書薯藷諸助叙女序徐恕鋤除傷償勝
匠升召哨商唱嘗奨妾娼宵将小少尚庄
床廠彰承抄招掌捷昇昌昭晶松梢樟樵
沼消渉湘焼焦照症省硝礁祥称章笑粧
紹肖菖蒋蕉衝裳訟証詔詳象賞醤鉦鍾
鐘障鞘上丈丞乗冗剰城場壌嬢常情擾
条杖浄状畳穣蒸譲醸錠嘱埴飾
拭植殖燭織職色触食蝕辱尻伸信侵唇
娠寝審心慎振新晋森榛浸深申疹真神
秦紳臣芯薪親診身辛進針震人仁刃塵
壬尋甚尽腎訊迅陣靭笥諏須酢図厨
逗吹垂帥推水炊睡粋翠衰遂酔錐錘随
瑞髄崇嵩数枢趨雛据杉椙菅頗雀裾澄
摺寸世瀬畝是凄制勢姓征性成政整星
晴棲栖正清牲生盛精聖声製西誠誓請
逝醒青静斉税脆隻席惜戚斥昔析石積
籍績脊責赤跡蹟碩切拙接摂折設窃節
説雪絶舌蝉仙先千占宣専尖川戦扇撰
栓栴泉浅洗染潜煎煽旋穿箭線
繊羨腺舛船薦詮賎践選遷銭銑閃鮮前
善漸然全禅繕膳糎噌塑岨措曾曽楚狙
疏疎礎祖租粗素組蘇訴阻遡鼠僧創双
叢倉喪壮奏爽宋層匝惣想捜掃挿掻
操早曹巣槍槽漕燥争痩相窓糟総綜聡
草荘葬蒼藻装走送遭鎗霜騒像増憎臓
蔵贈造促側則即息捉束測足速俗属賊
族続卒袖其揃存孫尊損村遜他多太汰
詑唾堕妥惰打柁舵楕陀駄騨体堆対耐
岱帯待怠態戴替泰滞胎腿苔袋貸退逮
隊黛鯛代台大第醍題鷹滝瀧卓啄宅托
択拓沢濯琢託鐸濁諾茸凧蛸只
叩但達辰奪脱巽竪辿棚谷狸鱈樽誰丹
単嘆坦担探旦歎淡湛炭短端箪綻耽胆
蛋誕鍛団壇弾断暖檀段男談値知地弛
恥智池痴稚置致蜘遅馳築畜竹筑蓄
逐秩窒茶嫡着中仲宙忠抽昼柱注虫衷
註酎鋳駐樗瀦猪苧著貯丁兆凋喋寵帖
帳庁弔張彫徴懲挑暢朝潮牒町眺聴脹
腸蝶調諜超跳銚長頂鳥勅捗直朕沈珍
賃鎮陳津墜椎槌追鎚痛通塚栂掴槻佃
漬柘辻蔦綴鍔椿潰坪壷嬬紬爪吊釣鶴
亭低停偵剃貞呈堤定帝底庭廷弟悌抵
挺提梯汀碇禎程締艇訂諦蹄逓
邸鄭釘鼎泥摘擢敵滴的笛適鏑溺哲徹
撤轍迭鉄典填天展店添纏甜貼転顛点
伝殿澱田電兎吐堵塗妬屠徒斗杜渡登
菟賭途都鍍砥砺努度土奴怒倒党冬
凍刀唐塔塘套宕島嶋悼投搭東桃梼棟
盗淘湯涛灯燈当痘祷等答筒糖統到董
蕩藤討謄豆踏逃透鐙陶頭騰闘働動同
堂導憧撞洞瞳童胴萄道銅峠鴇匿得徳
涜特督禿篤毒独読栃橡凸突椴届鳶苫
寅酉瀞噸屯惇敦沌豚遁頓呑曇鈍奈那
内乍凪薙謎灘捺鍋楢馴縄畷南楠軟難
汝二尼弐迩匂賑肉虹廿日乳入
如尿韮任妊忍認濡禰祢寧葱猫熱年念
捻撚燃粘乃廼之埜嚢悩濃納能脳膿農
覗蚤巴把播覇杷波派琶破婆罵芭馬俳
廃拝排敗杯盃牌背肺輩配倍培媒梅
楳煤狽買売賠陪這蝿秤矧萩伯剥博拍
柏泊白箔粕舶薄迫曝漠爆縛莫駁麦函
箱硲箸肇筈櫨幡肌畑畠八鉢溌発醗髪
伐罰抜筏閥鳩噺塙蛤隼伴判半反叛帆
搬斑板氾汎版犯班畔繁般藩販範釆煩
頒飯挽晩番盤磐蕃蛮匪卑否妃庇彼悲
扉批披斐比泌疲皮碑秘緋罷肥被誹費
避非飛樋簸備尾微枇毘琵眉美
鼻柊稗匹疋髭彦膝菱肘弼必畢筆逼桧
姫媛紐百謬俵彪標氷漂瓢票表評豹廟
描病秒苗錨鋲蒜蛭鰭品彬斌浜瀕貧賓
頻敏瓶不付埠夫婦富冨布府怖扶敷
斧普浮父符腐膚芙譜負賦赴阜附侮撫
武舞葡蕪部封楓風葺蕗伏副復幅服福
腹複覆淵弗払沸仏物鮒分吻噴墳憤扮
焚奮粉糞紛雰文聞丙併兵塀幣平弊柄
並蔽閉陛米頁僻壁癖碧別瞥蔑箆偏変
片篇編辺返遍便勉娩弁鞭保舗鋪圃捕
歩甫補輔穂募墓慕戊暮母簿菩倣俸包
呆報奉宝峰峯崩庖抱捧放方朋
法泡烹砲縫胞芳萌蓬蜂褒訪豊邦鋒飽
鳳鵬乏亡傍剖坊妨帽忘忙房暴望某棒
冒紡肪膨謀貌貿鉾防吠頬北僕卜墨撲
朴牧睦穆釦勃没殆堀幌奔本翻凡盆
摩磨魔麻埋妹昧枚毎哩槙幕膜枕鮪柾
鱒桝亦俣又抹末沫迄侭繭麿万慢満漫
蔓味未魅巳箕岬密蜜湊蓑稔脈妙粍民
眠務夢無牟矛霧鵡椋婿娘冥名命明盟
迷銘鳴姪牝滅免棉綿緬面麺摸模茂妄
孟毛猛盲網耗蒙儲木黙目杢勿餅尤戻
籾貰問悶紋門匁也冶夜爺耶野弥矢厄
役約薬訳躍靖柳薮鑓愉愈油癒
諭輸唯佑優勇友宥幽悠憂揖有柚湧涌
猶猷由祐裕誘遊邑郵雄融夕予余与誉
輿預傭幼妖容庸揚揺擁曜楊様洋溶熔
用窯羊耀葉蓉要謡踊遥陽養慾抑欲
沃浴翌翼淀羅螺裸来莱頼雷洛絡落酪
乱卵嵐欄濫藍蘭覧利吏履李梨理璃痢
裏裡里離陸律率立葎掠略劉流溜琉留
硫粒隆竜龍侶慮旅虜了亮僚両凌寮料
梁涼猟療瞭稜糧良諒遼量陵領力緑倫
厘林淋燐琳臨輪隣鱗麟瑠塁涙累類令
伶例冷励嶺怜玲礼苓鈴隷零霊麗齢暦
歴列劣烈裂廉恋憐漣煉簾練聯
蓮連錬呂魯櫓炉賂路露労婁廊弄朗楼
榔浪漏牢狼篭老聾蝋郎六麓禄肋録論
倭和話歪賄脇惑枠鷲亙亘鰐詫藁蕨椀
湾碗腕
弌丐丕个丱丶丼丿乂乖乘亂亅豫亊舒弍
于亞亟亠亢亰亳亶从仍仄仆仂仗仞仭
仟价伉佚估佛佝佗佇佶侈侏侘佻佩佰
侑佯來侖儘俔俟俎俘俛俑俚俐俤俥倚
倨倔倪倥倅伜俶倡倩倬俾俯們倆偃假
會偕偐偈做偖偬偸傀傚傅傴傲
僉僊傳僂僖僞僥僭僣僮價僵儉儁儂儖
儕儔儚儡儺儷儼儻儿兀兒兌兔兢竸兩
兪兮冀冂囘册冉冏冑冓冕冖冤冦冢冩
冪冫决冱冲冰况冽凅凉凛几處凩凭
凰凵凾刄刋刔刎刧刪刮刳刹剏剄剋剌
剞剔剪剴剩剳剿剽劍劔劒剱劈劑辨辧
劬劭劼劵勁勍勗勞勣勦飭勠勳勵勸勹
匆匈甸匍匐匏匕匚匣匯匱匳匸區卆卅
丗卉卍凖卞卩卮夘卻卷厂厖厠厦厥厮
厰厶參簒雙叟曼燮叮叨叭叺吁吽呀听
吭吼吮吶吩吝呎咏呵咎呟呱呷呰咒呻
咀呶咄咐咆哇咢咸咥咬哄哈咨
咫哂咤咾咼哘哥哦唏唔哽哮哭哺哢唹
啀啣啌售啜啅啖啗唸唳啝喙喀咯喊喟
啻啾喘喞單啼喃喩喇喨嗚嗅嗟嗄嗜嗤
嗔嘔嗷嘖嗾嗽嘛嗹噎噐營嘴嘶嘲嘸
噫噤嘯噬噪嚆嚀嚊嚠嚔嚏嚥嚮嚶嚴囂
嚼囁囃囀囈囎囑囓囗囮囹圀囿圄圉圈
國圍圓團圖嗇圜圦圷圸坎圻址坏坩埀
垈坡坿垉垓垠垳垤垪垰埃埆埔埒埓堊
埖埣堋堙堝塲堡塢塋塰毀塒堽塹墅墹
墟墫墺壞墻墸墮壅壓壑壗壙壘壥壜壤
壟壯壺壹壻壼壽夂夊夐夛梦夥夬夭夲
夸夾竒奕奐奎奚奘奢奠奧奬奩
奸妁妝佞侫妣妲姆姨姜妍姙姚娥娟娑
娜娉娚婀婬婉娵娶婢婪媚媼媾嫋嫂媽
嫣嫗嫦嫩嫖嫺嫻嬌嬋嬖嬲嫐嬪嬶嬾孃
孅孀孑孕孚孛孥孩孰孳孵學斈孺宀
它宦宸寃寇寉寔寐寤實寢寞寥寫寰寶
寳尅將專對尓尠尢尨尸尹屁屆屎屓屐
屏孱屬屮乢屶屹岌岑岔妛岫岻岶岼岷
峅岾峇峙峩峽峺峭嶌峪崋崕崗嵜崟崛
崑崔崢崚崙崘嵌嵒嵎嵋嵬嵳嵶嶇嶄嶂
嶢嶝嶬嶮嶽嶐嶷嶼巉巍巓巒巖巛巫已
巵帋帚帙帑帛帶帷幄幃幀幎幗幔幟幢
幤幇幵并幺麼广庠廁廂廈廐廏
廖廣廝廚廛廢廡廨廩廬廱廳廰廴廸廾
弃弉彝彜弋弑弖弩弭弸彁彈彌彎弯彑
彖彗彙彡彭彳彷徃徂彿徊很徑徇從徙
徘徠徨徭徼忖忻忤忸忱忝悳忿怡恠
怙怐怩怎怱怛怕怫怦怏怺恚恁恪恷恟
恊恆恍恣恃恤恂恬恫恙悁悍惧悃悚悄
悛悖悗悒悧悋惡悸惠惓悴忰悽惆悵惘
慍愕愆惶惷愀惴惺愃愡惻惱愍愎慇愾
愨愧慊愿愼愬愴愽慂慄慳慷慘慙慚慫
慴慯慥慱慟慝慓慵憙憖憇憬憔憚憊憑
憫憮懌懊應懷懈懃懆憺懋罹懍懦懣懶
懺懴懿懽懼懾戀戈戉戍戌戔戛
戞戡截戮戰戲戳扁扎扞扣扛扠扨扼抂
抉找抒抓抖拔抃抔拗拑抻拏拿拆擔拈
拜拌拊拂拇抛拉挌拮拱挧挂挈拯拵捐
挾捍搜捏掖掎掀掫捶掣掏掉掟掵捫
捩掾揩揀揆揣揉插揶揄搖搴搆搓搦搶
攝搗搨搏摧摯摶摎攪撕撓撥撩撈撼據
擒擅擇撻擘擂擱擧舉擠擡抬擣擯攬擶
擴擲擺攀擽攘攜攅攤攣攫攴攵攷收攸
畋效敖敕敍敘敞敝敲數斂斃變斛斟斫
斷旃旆旁旄旌旒旛旙无旡旱杲昊昃旻
杳昵昶昴昜晏晄晉晁晞晝晤晧晨晟晢
晰暃暈暎暉暄暘暝曁暹曉暾暼
曄暸曖曚曠昿曦曩曰曵曷朏朖朞朦朧
霸朮朿朶杁朸朷杆杞杠杙杣杤枉杰枩
杼杪枌枋枦枡枅枷柯枴柬枳柩枸柤柞
柝柢柮枹柎柆柧檜栞框栩桀桍栲桎
梳栫桙档桷桿梟梏梭梔條梛梃檮梹桴
梵梠梺椏梍桾椁棊椈棘椢椦棡椌棍棔
棧棕椶椒椄棗棣椥棹棠棯椨椪椚椣椡
棆楹楷楜楸楫楔楾楮椹楴椽楙椰楡楞
楝榁楪榲榮槐榿槁槓榾槎寨槊槝榻槃
榧樮榑榠榜榕榴槞槨樂樛槿權槹槲槧
樅榱樞槭樔槫樊樒櫁樣樓橄樌橲樶橸
橇橢橙橦橈樸樢檐檍檠檄檢檣
檗蘗檻櫃櫂檸檳檬櫞櫑櫟檪櫚櫪櫻欅
蘖櫺欒欖鬱欟欸欷盜欹飮歇歃歉歐歙
歔歛歟歡歸歹歿殀殄殃殍殘殕殞殤殪
殫殯殲殱殳殷殼毆毋毓毟毬毫毳毯
麾氈氓气氛氤氣汞汕汢汪沂沍沚沁沛
汾汨汳沒沐泄泱泓沽泗泅泝沮沱沾沺
泛泯泙泪洟衍洶洫洽洸洙洵洳洒洌浣
涓浤浚浹浙涎涕濤涅淹渕渊涵淇淦涸
淆淬淞淌淨淒淅淺淙淤淕淪淮渭湮渮
渙湲湟渾渣湫渫湶湍渟湃渺湎渤滿渝
游溂溪溘滉溷滓溽溯滄溲滔滕溏溥滂
溟潁漑灌滬滸滾漿滲漱滯漲滌
漾漓滷澆潺潸澁澀潯潛濳潭澂潼潘澎
澑濂潦澳澣澡澤澹濆澪濟濕濬濔濘濱
濮濛瀉瀋濺瀑瀁瀏濾瀛瀚潴瀝瀘瀟瀰
瀾瀲灑灣炙炒炯烱炬炸炳炮烟烋烝
烙焉烽焜焙煥煕熈煦煢煌煖煬熏燻熄
熕熨熬燗熹熾燒燉燔燎燠燬燧燵燼燹
燿爍爐爛爨爭爬爰爲爻爼爿牀牆牋牘
牴牾犂犁犇犒犖犢犧犹犲狃狆狄狎狒
狢狠狡狹狷倏猗猊猜猖猝猴猯猩猥猾
獎獏默獗獪獨獰獸獵獻獺珈玳珎玻珀
珥珮珞璢琅瑯琥珸琲琺瑕琿瑟瑙瑁瑜
瑩瑰瑣瑪瑶瑾璋璞璧瓊瓏瓔珱
瓠瓣瓧瓩瓮瓲瓰瓱瓸瓷甄甃甅甌甎甍
甕甓甞甦甬甼畄畍畊畉畛畆畚畩畤畧
畫畭畸當疆疇畴疊疉疂疔疚疝疥疣痂
疳痃疵疽疸疼疱痍痊痒痙痣痞痾痿
痼瘁痰痺痲痳瘋瘍瘉瘟瘧瘠瘡瘢瘤瘴
瘰瘻癇癈癆癜癘癡癢癨癩癪癧癬癰癲
癶癸發皀皃皈皋皎皖皓皙皚皰皴皸皹
皺盂盍盖盒盞盡盥盧盪蘯盻眈眇眄眩
眤眞眥眦眛眷眸睇睚睨睫睛睥睿睾睹
瞎瞋瞑瞠瞞瞰瞶瞹瞿瞼瞽瞻矇矍矗矚
矜矣矮矼砌砒礦砠礪硅碎硴碆硼碚碌
碣碵碪碯磑磆磋磔碾碼磅磊磬
磧磚磽磴礇礒礑礙礬礫祀祠祗祟祚祕
祓祺祿禊禝禧齋禪禮禳禹禺秉秕秧秬
秡秣稈稍稘稙稠稟禀稱稻稾稷穃穗穉
穡穢穩龝穰穹穽窈窗窕窘窖窩竈窰
窶竅竄窿邃竇竊竍竏竕竓站竚竝竡竢
竦竭竰笂笏笊笆笳笘笙笞笵笨笶筐筺
笄筍笋筌筅筵筥筴筧筰筱筬筮箝箘箟
箍箜箚箋箒箏筝箙篋篁篌篏箴篆篝篩
簑簔篦篥籠簀簇簓篳篷簗簍篶簣簧簪
簟簷簫簽籌籃籔籏籀籐籘籟籤籖籥籬
籵粃粐粤粭粢粫粡粨粳粲粱粮粹粽糀
糅糂糘糒糜糢鬻糯糲糴糶糺紆
紂紜紕紊絅絋紮紲紿紵絆絳絖絎絲絨
絮絏絣經綉絛綏絽綛綺綮綣綵緇綽綫
總綢綯緜綸綟綰緘緝緤緞緻緲緡縅縊
縣縡縒縱縟縉縋縢繆繦縻縵縹繃縷
縲縺繧繝繖繞繙繚繹繪繩繼繻纃緕繽
辮繿纈纉續纒纐纓纔纖纎纛纜缸缺罅
罌罍罎罐网罕罔罘罟罠罨罩罧罸羂羆
羃羈羇羌羔羞羝羚羣羯羲羹羮羶羸譱
翅翆翊翕翔翡翦翩翳翹飜耆耄耋耒耘
耙耜耡耨耿耻聊聆聒聘聚聟聢聨聳聲
聰聶聹聽聿肄肆肅肛肓肚肭冐肬胛胥
胙胝胄胚胖脉胯胱脛脩脣脯腋
隋腆脾腓腑胼腱腮腥腦腴膃膈膊膀膂
膠膕膤膣腟膓膩膰膵膾膸膽臀臂膺臉
臍臑臙臘臈臚臟臠臧臺臻臾舁舂舅與
舊舍舐舖舩舫舸舳艀艙艘艝艚艟艤
艢艨艪艫舮艱艷艸艾芍芒芫芟芻芬苡
苣苟苒苴苳苺莓范苻苹苞茆苜茉苙茵
茴茖茲茱荀茹荐荅茯茫茗茘莅莚莪莟
莢莖茣莎莇莊荼莵荳荵莠莉莨菴萓菫
菎菽萃菘萋菁菷萇菠菲萍萢萠莽萸蔆
菻葭萪萼蕚蒄葷葫蒭葮蒂葩葆萬葯葹
萵蓊葢蒹蒿蒟蓙蓍蒻蓚蓐蓁蓆蓖蒡蔡
蓿蓴蔗蔘蔬蔟蔕蔔蓼蕀蕣蕘蕈
蕁蘂蕋蕕薀薤薈薑薊薨蕭薔薛藪薇薜
蕷蕾薐藉薺藏薹藐藕藝藥藜藹蘊蘓蘋
藾藺蘆蘢蘚蘰蘿虍乕虔號虧虱蚓蚣蚩
蚪蚋蚌蚶蚯蛄蛆蚰蛉蠣蚫蛔蛞蛩蛬
蛟蛛蛯蜒蜆蜈蜀蜃蛻蜑蜉蜍蛹蜊蜴蜿
蜷蜻蜥蜩蜚蝠蝟蝸蝌蝎蝴蝗蝨蝮蝙蝓
蝣蝪蠅螢螟螂螯蟋螽蟀蟐雖螫蟄螳蟇
蟆螻蟯蟲蟠蠏蠍蟾蟶蟷蠎蟒蠑蠖蠕蠢
蠡蠱蠶蠹蠧蠻衄衂衒衙衞衢衫袁衾袞
衵衽袵衲袂袗袒袮袙袢袍袤袰袿袱裃
裄裔裘裙裝裹褂裼裴裨裲褄褌褊褓襃
褞褥褪褫襁襄褻褶褸襌褝襠襞
襦襤襭襪襯襴襷襾覃覈覊覓覘覡覩覦
覬覯覲覺覽覿觀觚觜觝觧觴觸訃訖訐
訌訛訝訥訶詁詛詒詆詈詼詭詬詢誅誂
誄誨誡誑誥誦誚誣諄諍諂諚諫諳諧
諤諱謔諠諢諷諞諛謌謇謚諡謖謐謗謠
謳鞫謦謫謾謨譁譌譏譎證譖譛譚譫譟
譬譯譴譽讀讌讎讒讓讖讙讚谺豁谿豈
豌豎豐豕豢豬豸豺貂貉貅貊貍貎貔豼
貘戝貭貪貽貲貳貮貶賈賁賤賣賚賽賺
賻贄贅贊贇贏贍贐齎贓賍贔贖赧赭赱
赳趁趙跂趾趺跏跚跖跌跛跋跪跫跟跣
跼踈踉跿踝踞踐踟蹂踵踰踴蹊
蹇蹉蹌蹐蹈蹙蹤蹠踪蹣蹕蹶蹲蹼躁躇
躅躄躋躊躓躑躔躙躪躡躬躰軆躱躾軅
軈軋軛軣軼軻軫軾輊輅輕輒輙輓輜輟
輛輌輦輳輻輹轅轂輾轌轉轆轎轗轜
轢轣轤辜辟辣辭辯辷迚迥迢迪迯邇迴
逅迹迺逑逕逡逍逞逖逋逧逶逵逹迸遏
遐遑遒逎遉逾遖遘遞遨遯遶隨遲邂遽
邁邀邊邉邏邨邯邱邵郢郤扈郛鄂鄒鄙
鄲鄰酊酖酘酣酥酩酳酲醋醉醂醢醫醯
醪醵醴醺釀釁釉釋釐釖釟釡釛釼釵釶
鈞釿鈔鈬鈕鈑鉞鉗鉅鉉鉤鉈銕鈿鉋鉐
銜銖銓銛鉚鋏銹銷鋩錏鋺鍄錮
錙錢錚錣錺錵錻鍜鍠鍼鍮鍖鎰鎬鎭鎔
鎹鏖鏗鏨鏥鏘鏃鏝鏐鏈鏤鐚鐔鐓鐃鐇
鐐鐶鐫鐵鐡鐺鑁鑒鑄鑛鑠鑢鑞鑪鈩鑰
鑵鑷鑽鑚鑼鑾钁鑿閂閇閊閔閖閘閙
閠閨閧閭閼閻閹閾闊濶闃闍闌闕闔闖
關闡闥闢阡阨阮阯陂陌陏陋陷陜陞陝
陟陦陲陬隍隘隕隗險隧隱隲隰隴隶隸
隹雎雋雉雍襍雜霍雕雹霄霆霈霓霎霑
霏霖霙霤霪霰霹霽霾靄靆靈靂靉靜靠
靤靦靨勒靫靱靹鞅靼鞁靺鞆鞋鞏鞐鞜
鞨鞦鞣鞳鞴韃韆韈韋韜韭齏韲竟韶韵
頏頌頸頤頡頷頽顆顏顋顫顯顰
顱顴顳颪颯颱颶飄飃飆飩飫餃餉餒餔
餘餡餝餞餤餠餬餮餽餾饂饉饅饐饋饑
饒饌饕馗馘馥馭馮馼駟駛駝駘駑駭駮
駱駲駻駸騁騏騅駢騙騫騷驅驂驀驃
騾驕驍驛驗驟驢驥驤驩驫驪骭骰骼髀
髏髑髓體髞髟髢髣髦髯髫髮髴髱髷髻
鬆鬘鬚鬟鬢鬣鬥鬧鬨鬩鬪鬮鬯鬲魄魃
魏魍魎魑魘魴鮓鮃鮑鮖鮗鮟鮠鮨鮴鯀
鯊鮹鯆鯏鯑鯒鯣鯢鯤鯔鯡鰺鯲鯱鯰鰕
鰔鰉鰓鰌鰆鰈鰒鰊鰄鰮鰛鰥鰤鰡鰰鱇
鰲鱆鰾鱚鱠鱧鱶鱸鳧鳬鳰鴉鴈鳫鴃鴆
鴪鴦鶯鴣鴟鵄鴕鴒鵁鴿鴾鵆鵈
鵝鵞鵤鵑鵐鵙鵲鶉鶇鶫鵯鵺鶚鶤鶩鶲
鷄鷁鶻鶸鶺鷆鷏鷂鷙鷓鷸鷦鷭鷯鷽鸚
鸛鸞鹵鹹鹽麁麈麋麌麒麕麑麝麥麩麸
麪麭靡黌黎黏黐黔黜點黝黠黥黨黯
黴黶黷黹黻黼黽鼇鼈皷鼕鼡鼬鼾齊齒
齔齣齟齠齡齦齧齬齪齷齲齶龕龜龠堯
槇遙瑤凜熙
";

$char_list = str_replace(array("\r\n","\n","\r"), '', $char_list);

$list = array();
$cnt = 0;
for($yy = 15; $yy < 47; $yy++){
  for($xx = 0; $xx < 94; $xx++){
    $hex = array();
    for($x = 0; $x < 8; $x++){ // misaki_gothic_Kanji_list.txt 用
//    for($x = 0; $x < 7; $x++){ // kanji_table.js 用 8バイト目は必ず0x00になるので7バイトのみ取得
      $bin = '';
      for($y = 7; $y >= 0; $y--){
        $rgb = imagecolorat($img, $x+($xx * 8), $y + ($yy * 8));
        $colors = imagecolorsforindex($img, $rgb);
        if($colors['red'] != '0'){
          $bin.="0";
        }else{
          $bin.="1";
        }
      }
      $hex[] = sprintf("0x%02s",dechex(bindec($bin)));
    }

    if(hexdec($hex[0])==0 
      && hexdec($hex[1])==0
      && hexdec($hex[2])==0
      && hexdec($hex[3])==0
      && hexdec($hex[4])==0
      && hexdec($hex[5])==0
      && hexdec($hex[6])==0
      && hexdec($hex[7])==0
      ){
      break;
    }

    $list[$cnt]['hex'] = implode(",", $hex);
    $list[$cnt]['char'] = mb_substr($char_list,$cnt,1);
    $cnt++;
  }
}

for($yy = 47; $yy < 84; $yy++){
  for($xx = 0; $xx < 94; $xx++){
    $hex = array();
    for($x = 0; $x < 8; $x++){ // misaki_gothic_Kanji_list.txt 用
//    for($x = 0; $x < 7; $x++){ // kanji_table.js 用 8バイト目は必ず0x00になるので7バイトのみ取得
      $bin = '';
      for($y = 7; $y >= 0; $y--){
        $rgb = imagecolorat($img, $x+($xx * 8), $y + ($yy * 8));
        $colors = imagecolorsforindex($img, $rgb);
        if($colors['red'] != '0'){
          $bin.="0";
        }else{
          $bin.="1";
        }
      }
      $hex[] = sprintf("0x%02s",dechex(bindec($bin)));
    }

    if(hexdec($hex[0])==0 
      && hexdec($hex[1])==0
      && hexdec($hex[2])==0
      && hexdec($hex[3])==0
      && hexdec($hex[4])==0
      && hexdec($hex[5])==0
      && hexdec($hex[6])==0
      && hexdec($hex[7])==0
      ){
      break;
    }

    $list[$cnt]['hex'] = implode(",", $hex);
    $list[$cnt]['char'] = mb_substr($char_list,$cnt,1);
    $cnt++;
  }
}

?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ja" lang="ja">
<head>
<title></title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
</head>
<body>
<?php

for($i = 0; $i < LIST_MAX; $i++){
  printf("{ %s },/* %s */<br>", $list[$i]['hex'], $list[$i]['char']); // misaki_gothic_Kanji_list.txt 用
//  printf("'%s':'%s',\n<br>",$list[$i]['char'],$list[$i]['hex']); // kanji_table.js 用
}

?>
</body>
</html>
